[
    {
        "profId": "p002",
        "name": "Alex Dilhofff",
        "rating": 4.4,
        "gradeTilt": "balanced",
        "difficulty": 3.4,
        "notes": "Explains concepts with real-world examples and holds structured review sessions. Projects are meaningful and exams reward consistent practice."
    },
    {
        "profId": "p003",
        "name": "Alexandra Stefan",
        "rating": 3.5,
        "gradeTilt": "rigorous",
        "difficulty": 4.0,
        "notes": "Detailed lectures with high expectations for precision. Assignments can be time-intensive, but rubrics are clear and office hours are helpful."
    },
    {
        "profId": "p004",
        "name": "Donna French",
        "rating": 3.9,
        "gradeTilt": "lenient",
        "difficulty": 2.9,
        "notes": "Very organized slides and plenty of practice problems. Grading is transparent and supportive, with frequent feedback on fundamentals."
    },
    {
        "profId": "p005",
        "name": "Shawn Gieser",
        "rating": 3.2,
        "gradeTilt": "balanced",
        "difficulty": 3.2,
        "notes": "Project-focused approach with weekly check-ins. Fair exams that reflect homework; participation can boost understanding."
    },
    {
        "profId": "p006",
        "name": "Nadra Guizani",
        "rating": 3.0,
        "gradeTilt": "lenient",
        "difficulty": 2.8,
        "notes": "Step-by-step demos and straightforward quizzes. Flexible help during office hours and constructive feedback on labs."
    },
    {
        "profId": "p007",
        "name": "janicm Tierman",
        "rating": 3.0,
        "gradeTilt": "rigorous",
        "difficulty": 5.0,
        "notes": "Fast-paced course that emphasizes deep understanding. Start assignments early; exams are challenging but align with lecture topics."
    },
    {
        "profId": "p008",
        "name": "Miao Yin",
        "rating": 4.3,
        "gradeTilt": "balanced",
        "difficulty": 3.4,
        "notes": "Connects theory to practical applications and provides timely feedback. Projects build skills progressively across the term."
    },
    {
        "profId": "p009",
        "name": "Subharag Sarkar",
        "rating": 3.2,
        "gradeTilt": "rigorous",
        "difficulty": 3.7,
        "notes": "Strong focus on algorithms and problem-solving. Homework sets are demanding but prepare you well for exams."
    },
    {
        "profId": "p010",
        "name": "William Beksi",
        "rating": 3.0,
        "gradeTilt": "rigorous",
        "difficulty": 3.8,
        "notes": "Hands-on labs with an emphasis on coding quality. Expectations are clear; staying current with readings greatly helps."
    },
    {
        "profId": "p001",
        "name": "Bob Weems",
        "rating": 3.0,
        "gradeTilt": "balanced",
        "difficulty": 3.4,
        "notes": "Focuses on core fundamentals and consistent style. Lectures are straightforward, and occasional extra practice is offered."
    }
]